<details>
<summary>Execution result of "run-all plan" in "infrastructure/aws"</summary>

```terraform
17:38:04.869 INFO   The stack at /github/workspace/infrastructure/aws will be processed in the following order for command plan:
Group 1
- Module management/north-virginia/aws_accounts/development
- Module management/north-virginia/aws_accounts/playground
- Module management/north-virginia/aws_accounts/production
- Module management/north-virginia/aws_accounts/staging
- Module management/north-virginia/aws_organization
- Module management/north-virginia/vpc
- Module playground/north-virginia/vpc


17:38:05.067 INFO   [management/north-virginia/aws_accounts/playground] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_account into /github/workspace/infrastructure/aws/management/north-virginia/aws_accounts/playground/.terragrunt-cache/pamcXYsh7Pqpp5BrO4tFjqhSqzs/10o_Yfon3CbB0MLOTJl69oEly1g
17:38:05.081 INFO   [management/north-virginia/aws_accounts/development] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_account into /github/workspace/infrastructure/aws/management/north-virginia/aws_accounts/development/.terragrunt-cache/j0C_BYobrhgsSyiqJZ0ZarPofZg/10o_Yfon3CbB0MLOTJl69oEly1g
17:38:05.106 INFO   [playground/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/infrastructure/aws/playground/north-virginia/vpc/.terragrunt-cache/_n5IKqt3mrmwcd0qdbmFt6RLz1g/A35GeYiqYDYXDWZftKtd1kkU5ic
17:38:05.122 INFO   [management/north-virginia/aws_accounts/production] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_account into /github/workspace/infrastructure/aws/management/north-virginia/aws_accounts/production/.terragrunt-cache/6VjrPQHNWhMLdU647InRiqyYrGQ/10o_Yfon3CbB0MLOTJl69oEly1g
17:38:05.124 INFO   [management/north-virginia/vpc] Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git into /github/workspace/infrastructure/aws/management/north-virginia/vpc/.terragrunt-cache/tN8aN2Wrm1ax0JOoNGxYDj4UZc8/A35GeYiqYDYXDWZftKtd1kkU5ic
17:38:05.131 INFO   [management/north-virginia/aws_accounts/staging] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_account into /github/workspace/infrastructure/aws/management/north-virginia/aws_accounts/staging/.terragrunt-cache/55NsBp3QjHQ3cMqHAIROqKAA-Rc/10o_Yfon3CbB0MLOTJl69oEly1g
17:38:05.134 INFO   [management/north-virginia/aws_organization] Downloading Terraform configurations from file:///github/workspace/modules/aws/aws_organization into /github/workspace/infrastructure/aws/management/north-virginia/aws_organization/.terragrunt-cache/BmOb26uR7vqlaJoMBL_XANu2c6k/kLn2nKw80j_MBMKRZUlBCyiMAms
17:38:06.072 STDOUT [management/north-virginia/aws_accounts/development] tofu: Initializing the backend...
17:38:06.083 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Initializing the backend...
17:38:06.089 STDOUT [management/north-virginia/aws_accounts/production] tofu: Initializing the backend...
17:38:06.089 STDOUT [management/north-virginia/aws_organization] tofu: Initializing the backend...
17:38:06.089 STDOUT [management/north-virginia/aws_accounts/staging] tofu: Initializing the backend...
17:38:06.162 STDOUT [management/north-virginia/vpc] tofu: Initializing the backend...
17:38:06.711 STDOUT [management/north-virginia/aws_accounts/production] tofu: 
17:38:06.711 STDOUT [management/north-virginia/aws_accounts/production] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:38:06.711 STDOUT [management/north-virginia/aws_accounts/production] tofu: use this backend unless the backend configuration changes.
17:38:06.718 STDOUT [management/north-virginia/aws_organization] tofu: 
17:38:06.718 STDOUT [management/north-virginia/aws_organization] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:38:06.718 STDOUT [management/north-virginia/aws_organization] tofu: use this backend unless the backend configuration changes.
17:38:06.721 STDOUT [management/north-virginia/aws_accounts/development] tofu: 
17:38:06.721 STDOUT [management/north-virginia/aws_accounts/development] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:38:06.721 STDOUT [management/north-virginia/aws_accounts/development] tofu: use this backend unless the backend configuration changes.
17:38:06.723 STDOUT [management/north-virginia/aws_accounts/staging] tofu: 
17:38:06.723 STDOUT [management/north-virginia/aws_accounts/staging] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:38:06.723 STDOUT [management/north-virginia/aws_accounts/staging] tofu: use this backend unless the backend configuration changes.
17:38:06.751 STDOUT [management/north-virginia/aws_accounts/playground] tofu: 
17:38:06.751 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:38:06.751 STDOUT [management/north-virginia/aws_accounts/playground] tofu: use this backend unless the backend configuration changes.
17:38:06.755 STDOUT [management/north-virginia/vpc] tofu: 
17:38:06.755 STDOUT [management/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:38:06.755 STDOUT [management/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
17:38:06.798 STDOUT [playground/north-virginia/vpc] tofu: Initializing the backend...
17:38:06.965 STDOUT [management/north-virginia/aws_accounts/staging] tofu: Initializing provider plugins...
17:38:06.965 STDOUT [management/north-virginia/aws_accounts/staging] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
17:38:06.981 STDOUT [management/north-virginia/aws_accounts/production] tofu: Initializing provider plugins...
17:38:06.981 STDOUT [management/north-virginia/aws_accounts/production] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
17:38:06.998 STDOUT [management/north-virginia/aws_accounts/development] tofu: Initializing provider plugins...
17:38:06.998 STDOUT [management/north-virginia/aws_accounts/development] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
17:38:07.060 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Initializing provider plugins...
17:38:07.060 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
17:38:07.065 STDOUT [management/north-virginia/aws_organization] tofu: Initializing provider plugins...
17:38:07.065 STDOUT [management/north-virginia/aws_organization] tofu: - Finding hashicorp/aws versions matching ">= 4.0.0"...
17:38:07.103 STDOUT [management/north-virginia/vpc] tofu: Initializing provider plugins...
17:38:07.103 STDOUT [management/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
17:38:07.419 STDOUT [playground/north-virginia/vpc] tofu: 
17:38:07.419 STDOUT [playground/north-virginia/vpc] tofu: Successfully configured the backend "s3"! OpenTofu will automatically
17:38:07.419 STDOUT [playground/north-virginia/vpc] tofu: use this backend unless the backend configuration changes.
17:38:07.731 STDOUT [playground/north-virginia/vpc] tofu: Initializing provider plugins...
17:38:07.731 STDOUT [playground/north-virginia/vpc] tofu: - Finding hashicorp/aws versions matching ">= 5.79.0"...
17:38:08.076 STDOUT [management/north-virginia/aws_organization] tofu: - Installing hashicorp/aws v5.94.0...
17:38:08.100 STDOUT [management/north-virginia/aws_accounts/production] tofu: - Installing hashicorp/aws v5.94.0...
17:38:08.127 STDOUT [management/north-virginia/aws_accounts/staging] tofu: - Installing hashicorp/aws v5.94.0...
17:38:08.172 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Installing hashicorp/aws v5.94.0...
17:38:08.179 STDOUT [management/north-virginia/aws_accounts/development] tofu: - Installing hashicorp/aws v5.94.0...
17:38:08.298 STDOUT [management/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.94.0...
17:38:08.445 STDOUT [playground/north-virginia/vpc] tofu: - Installing hashicorp/aws v5.94.0...
17:38:17.152 STDOUT [management/north-virginia/aws_accounts/staging] tofu: - Installed hashicorp/aws v5.94.0 (signed, key ID 0C0AF313E5FD9F80)
17:38:17.152 STDOUT [management/north-virginia/aws_accounts/staging] tofu: Providers are signed by their developers.
17:38:17.152 STDOUT [management/north-virginia/aws_accounts/staging] tofu: If you'd like to know more about provider signing, you can read about it here:
17:38:17.152 STDOUT [management/north-virginia/aws_accounts/staging] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:38:17.152 STDOUT [management/north-virginia/aws_accounts/staging] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:38:17.152 STDOUT [management/north-virginia/aws_accounts/staging] tofu: selections it made above. Include this file in your version control repository
17:38:17.152 STDOUT [management/north-virginia/aws_accounts/staging] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:38:17.152 STDOUT [management/north-virginia/aws_accounts/staging] tofu: you run "tofu init" in the future.
17:38:17.152 STDOUT [management/north-virginia/aws_accounts/staging] tofu: OpenTofu has been successfully initialized!
17:38:17.687 STDOUT [management/north-virginia/aws_organization] tofu: - Installed hashicorp/aws v5.94.0 (signed, key ID 0C0AF313E5FD9F80)
17:38:17.687 STDOUT [management/north-virginia/aws_organization] tofu: Providers are signed by their developers.
17:38:17.687 STDOUT [management/north-virginia/aws_organization] tofu: If you'd like to know more about provider signing, you can read about it here:
17:38:17.687 STDOUT [management/north-virginia/aws_organization] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:38:17.687 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:38:17.687 STDOUT [management/north-virginia/aws_organization] tofu: selections it made above. Include this file in your version control repository
17:38:17.687 STDOUT [management/north-virginia/aws_organization] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:38:17.687 STDOUT [management/north-virginia/aws_organization] tofu: you run "tofu init" in the future.
17:38:17.687 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has been successfully initialized!
17:38:17.930 STDOUT [playground/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.94.0 (signed, key ID 0C0AF313E5FD9F80)
17:38:17.930 STDOUT [playground/north-virginia/vpc] tofu: Providers are signed by their developers.
17:38:17.930 STDOUT [playground/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
17:38:17.930 STDOUT [playground/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:38:17.930 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:38:17.930 STDOUT [playground/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
17:38:17.930 STDOUT [playground/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:38:17.930 STDOUT [playground/north-virginia/vpc] tofu: you run "tofu init" in the future.
17:38:17.930 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
17:38:18.669 STDOUT [management/north-virginia/vpc] tofu: - Installed hashicorp/aws v5.94.0 (signed, key ID 0C0AF313E5FD9F80)
17:38:18.669 STDOUT [management/north-virginia/vpc] tofu: Providers are signed by their developers.
17:38:18.669 STDOUT [management/north-virginia/vpc] tofu: If you'd like to know more about provider signing, you can read about it here:
17:38:18.669 STDOUT [management/north-virginia/vpc] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:38:18.669 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:38:18.669 STDOUT [management/north-virginia/vpc] tofu: selections it made above. Include this file in your version control repository
17:38:18.669 STDOUT [management/north-virginia/vpc] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:38:18.669 STDOUT [management/north-virginia/vpc] tofu: you run "tofu init" in the future.
17:38:18.670 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has been successfully initialized!
17:38:18.719 STDOUT [management/north-virginia/aws_accounts/development] tofu: - Installed hashicorp/aws v5.94.0 (signed, key ID 0C0AF313E5FD9F80)
17:38:18.720 STDOUT [management/north-virginia/aws_accounts/development] tofu: Providers are signed by their developers.
17:38:18.720 STDOUT [management/north-virginia/aws_accounts/development] tofu: If you'd like to know more about provider signing, you can read about it here:
17:38:18.720 STDOUT [management/north-virginia/aws_accounts/development] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:38:18.722 STDOUT [management/north-virginia/aws_accounts/development] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:38:18.722 STDOUT [management/north-virginia/aws_accounts/development] tofu: selections it made above. Include this file in your version control repository
17:38:18.722 STDOUT [management/north-virginia/aws_accounts/development] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:38:18.722 STDOUT [management/north-virginia/aws_accounts/development] tofu: you run "tofu init" in the future.
17:38:18.723 STDOUT [management/north-virginia/aws_accounts/development] tofu: OpenTofu has been successfully initialized!
17:38:22.401 STDOUT [management/north-virginia/aws_accounts/production] tofu: - Installed hashicorp/aws v5.94.0 (signed, key ID 0C0AF313E5FD9F80)
17:38:22.401 STDOUT [management/north-virginia/aws_accounts/production] tofu: Providers are signed by their developers.
17:38:22.401 STDOUT [management/north-virginia/aws_accounts/production] tofu: If you'd like to know more about provider signing, you can read about it here:
17:38:22.401 STDOUT [management/north-virginia/aws_accounts/production] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:38:22.401 STDOUT [management/north-virginia/aws_accounts/production] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:38:22.401 STDOUT [management/north-virginia/aws_accounts/production] tofu: selections it made above. Include this file in your version control repository
17:38:22.401 STDOUT [management/north-virginia/aws_accounts/production] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:38:22.401 STDOUT [management/north-virginia/aws_accounts/production] tofu: you run "tofu init" in the future.
17:38:22.401 STDOUT [management/north-virginia/aws_accounts/production] tofu: OpenTofu has been successfully initialized!
17:38:24.805 STDOUT [management/north-virginia/aws_accounts/playground] tofu: - Installed hashicorp/aws v5.94.0 (signed, key ID 0C0AF313E5FD9F80)
17:38:24.805 STDOUT [management/north-virginia/aws_accounts/playground] tofu: Providers are signed by their developers.
17:38:24.805 STDOUT [management/north-virginia/aws_accounts/playground] tofu: If you'd like to know more about provider signing, you can read about it here:
17:38:24.805 STDOUT [management/north-virginia/aws_accounts/playground] tofu: https://opentofu.org/docs/cli/plugins/signing/
17:38:24.805 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
17:38:24.806 STDOUT [management/north-virginia/aws_accounts/playground] tofu: selections it made above. Include this file in your version control repository
17:38:24.806 STDOUT [management/north-virginia/aws_accounts/playground] tofu: so that OpenTofu can guarantee to make the same selections by default when
17:38:24.806 STDOUT [management/north-virginia/aws_accounts/playground] tofu: you run "tofu init" in the future.
17:38:24.806 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has been successfully initialized!
17:38:25.352 STDOUT [management/north-virginia/aws_organization] tofu: aws_organizations_organization.org: Refreshing state... [id=o-4s1jxdnpu3]
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu: OpenTofu used the selected providers to generate the following execution
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu: plan. Resource actions are indicated with the following symbols:
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu:   + create
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu: OpenTofu will perform the following actions:
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu:   # aws_organizations_account.account will be created
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu:   + resource "aws_organizations_account" "account" {
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + arn               = (known after apply)
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + close_on_deletion = true
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + create_govcloud   = false
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + email             = "yashraj.dighe077+aws-staging@gmail.com"
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + govcloud_id       = (known after apply)
17:38:25.913 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + id                = (known after apply)
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + joined_method     = (known after apply)
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + joined_timestamp  = (known after apply)
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + name              = "staging"
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + parent_id         = (known after apply)
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + role_name         = "OrganizationAccountAccessRole"
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + status            = (known after apply)
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:       + tags_all          = {
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:           + "creator"     = "terraform/terragrunt"
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:           + "environment" = "management"
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:           + "platform"    = "aws"
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:           + "project"     = "iac"
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:           + "team"        = "devops"
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:         }
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:     }
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu: 
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu: Changes to Outputs:
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:   + account_arn            = (known after apply)
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:   + account_id             = (known after apply)
17:38:25.914 STDOUT [management/north-virginia/aws_accounts/staging] tofu:   + organization_role_name = "OrganizationAccountAccessRole"
17:38:26.315 STDOUT [playground/north-virginia/vpc] tofu: No changes. Your infrastructure matches the configuration.
17:38:26.315 STDOUT [playground/north-virginia/vpc] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:38:26.315 STDOUT [playground/north-virginia/vpc] tofu: found no differences, so no changes are needed.
17:38:26.522 STDOUT [management/north-virginia/aws_organization] tofu: No changes. Your infrastructure matches the configuration.
17:38:26.522 STDOUT [management/north-virginia/aws_organization] tofu: 
17:38:26.522 STDOUT [management/north-virginia/aws_organization] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:38:26.522 STDOUT [management/north-virginia/aws_organization] tofu: found no differences, so no changes are needed.
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu: OpenTofu used the selected providers to generate the following execution
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu: plan. Resource actions are indicated with the following symbols:
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu:   + create
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu: OpenTofu will perform the following actions:
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu:   # aws_organizations_account.account will be created
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu:   + resource "aws_organizations_account" "account" {
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + arn               = (known after apply)
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + close_on_deletion = true
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + create_govcloud   = false
17:38:27.268 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + email             = "yashraj.dighe077+aws-development@gmail.com"
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + govcloud_id       = (known after apply)
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + id                = (known after apply)
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + joined_method     = (known after apply)
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + joined_timestamp  = (known after apply)
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + name              = "development"
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + parent_id         = (known after apply)
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + role_name         = "OrganizationAccountAccessRole"
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + status            = (known after apply)
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:       + tags_all          = {
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:           + "creator"     = "terraform/terragrunt"
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:           + "environment" = "management"
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:           + "platform"    = "aws"
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:           + "project"     = "iac"
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:           + "team"        = "devops"
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:         }
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:     }
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu: 
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu: Changes to Outputs:
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:   + account_arn            = (known after apply)
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:   + account_id             = (known after apply)
17:38:27.269 STDOUT [management/north-virginia/aws_accounts/development] tofu:   + organization_role_name = "OrganizationAccountAccessRole"
17:38:27.324 STDOUT [management/north-virginia/vpc] tofu: No changes. Your infrastructure matches the configuration.
17:38:27.324 STDOUT [management/north-virginia/vpc] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:38:27.324 STDOUT [management/north-virginia/vpc] tofu: found no differences, so no changes are needed.
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu: OpenTofu used the selected providers to generate the following execution
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu: plan. Resource actions are indicated with the following symbols:
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:   + create
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu: OpenTofu will perform the following actions:
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:   # aws_organizations_account.account will be created
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:   + resource "aws_organizations_account" "account" {
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + arn               = (known after apply)
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + close_on_deletion = true
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + create_govcloud   = false
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + email             = "yashraj.dighe077+aws-production@gmail.com"
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + govcloud_id       = (known after apply)
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + id                = (known after apply)
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + joined_method     = (known after apply)
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + joined_timestamp  = (known after apply)
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + name              = "production"
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + parent_id         = (known after apply)
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + role_name         = "OrganizationAccountAccessRole"
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + status            = (known after apply)
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:       + tags_all          = {
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:           + "creator"     = "terraform/terragrunt"
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:           + "environment" = "management"
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:           + "platform"    = "aws"
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:           + "project"     = "iac"
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:           + "team"        = "devops"
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:         }
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:     }
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu: 
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu: Changes to Outputs:
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:   + account_arn            = (known after apply)
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:   + account_id             = (known after apply)
17:38:28.312 STDOUT [management/north-virginia/aws_accounts/production] tofu:   + organization_role_name = "OrganizationAccountAccessRole"
17:38:29.332 STDOUT [management/north-virginia/aws_accounts/playground] tofu: aws_organizations_account.account: Refreshing state... [id=672491114190]
17:38:30.025 STDOUT [management/north-virginia/aws_accounts/playground] tofu: No changes. Your infrastructure matches the configuration.
17:38:30.025 STDOUT [management/north-virginia/aws_accounts/playground] tofu: OpenTofu has compared your real infrastructure against your configuration and
17:38:30.025 STDOUT [management/north-virginia/aws_accounts/playground] tofu: found no differences, so no changes are needed.
```

</details>
    
